## Terraform Plan Summary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.dev_log_data_567 will be created
  + resource "google_storage_bucket" "dev_log_data_567" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "dev-log-data-567"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.ir_bucket_demo will be created
  + resource "google_storage_bucket" "ir_bucket_demo" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "ir-bucket-demo"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_first_demo_bucket will be created
  + resource "google_storage_bucket" "my_first_demo_bucket" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-first-demo-bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_testing_bucket_987 will be created
  + resource "google_storage_bucket" "my_testing_bucket_987" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-testing-bucket-987"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.nainar_maheswari_dev_bucket will be created
  + resource "google_storage_bucket" "nainar_maheswari_dev_bucket" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "nainar-maheswari-dev-bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.one_last_2923929296 will be created
  + resource "google_storage_bucket" "one_last_2923929296" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "one-last-2923929296"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.poc_lab_week_bucket will be created
  + resource "google_storage_bucket" "poc_lab_week_bucket" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "poc-lab-week-bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.testing_01_3234343 will be created
  + resource "google_storage_bucket" "testing_01_3234343" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "testing-01-3234343"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.testing_01_bucket_10323 will be created
  + resource "google_storage_bucket" "testing_01_bucket_10323" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "testing-01-bucket-10323"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.testing_12_bucket_123 will be created
  + resource "google_storage_bucket" "testing_12_bucket_123" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "US-CENTRAL1"
      + name                        = "testing-12-bucket-123"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.this_is_my_bucket_2921019019 will be created
  + resource "google_storage_bucket" "this_is_my_bucket_2921019019" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "this-is-my-bucket-2921019019"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.unique_system_bucket_1034343 will be created
  + resource "google_storage_bucket" "unique_system_bucket_1034343" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "unique-system-bucket-1034343"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
